[[_TOC_]]
# Задача 1 
## Условие
Самостоятельно реализовать указанные строковые функции.

0. strpbrk
1. strspn
2. strcspn
3. strchr
4. strrchr

## Декомпозиция
char *my_strpbrk(const char *s1, const char *s2) - моя strpbrk.  
size_t my_strspn(const char *s1, const char *s2) - моя strspn.  
size_t my_strcspn(const char *s1, const char *s2) - моя strcspn.  
char *my_strchr(const char *str, int c) - моя strchr.  
char *my_strrchr(const char *str, int c) - моя strrchr.  

## Компиляция
```
$ ./make_debug.cmd

C:\msys64\home\Vlad\iu7-cprog-labs-2020-leonovvladislav\lab_04_1>gcc -std=c99 -Wall -Wpedantic -Wextra -Werror -g3 -Wfloat-equal -Wvla -fprofile-arcs -ftest-coverage -c main.c

C:\msys64\home\Vlad\iu7-cprog-labs-2020-leonovvladislav\lab_04_1>gcc -std=c99 -Wall -Wpedantic -Wextra -Werror -g3 -Wfloat-equal -Wvla -fprofile-arcs -ftest-coverage -c my_string.c

C:\msys64\home\Vlad\iu7-cprog-labs-2020-leonovvladislav\lab_04_1>gcc -o app.exe main.o my_string.o -lgcov

```
## Тестирование
Используется модульное тестирование.  
### Покрытие тестами
```
$ gcov main.c my_string.c
File 'main.c'
Lines executed:36.36% of 44
Creating 'main.c.gcov'

File 'C:/msys64/mingw64/x86_64-w64-mingw32/include/stdio.h'
Lines executed:0.00% of 5
Creating 'stdio.h.gcov'

File 'my_string.c'
Lines executed:100.00% of 39
Creating 'my_string.c.gcov'
```

# Задача 2 
## Условие
Написать программу, которая запрашивает у пользователя одну или две строки, разбивает
строку (или строки) на слова и выполняет обработку этих слов. Разбиение строки на слова реализуется самостоятельно (использовать для выделения слов функции scanf, sscanf или strtok нельзя).

В результате разбора строки должен быть сформирован массив слов (один или несколько).
После чего выполняется обработка одного или нескольких массивов слов.

Длина строки не превышает 256 символов, длина слова - 16-ти символов. Слова разделяются одним или несколькими пробелами и знаками пунктуации (“,”, “;”, “:”, “-”, “.”, “!”, “?”).

Результаты выводятся обязательно после фразы "Result:" (кавычки не нужны). Слова (или
слова и числа) разделяются одним пробелом.

В случае если задача решение не может быть получено, на экран ничего не выводится,
возвращается код ошибки. Обратите внимание на ограничения по длине строке и по длине
слова. 

Ввести одну строку. Для каждого слова подсчитать количество его встреч в исходной
строке. Программа должна вывести пары: “слово” “количество встреч” (кавычки не
нужны). Каждая пара выводится на отдельной строке. Слова выводятся в том порядке,
в котором они встретились в исходной строке.

## Декомпозиция
long str_reading(char *str_in) - чтение строки.    
size_t get_words(char *str_in, char words_arr[][MAXWORDSIZE + 1]) - счетчик уникальных слов.  
void print_every_word_count(char words_arr[][MAXWORDSIZE + 1], size_t words_count) - печать уникальных слов.
## Компиляция
```
$ ./make_debug.cmd

C:\msys64\home\Vlad\iu7-cprog-labs-2020-leonovvladislav\lab_04_00_02>gcc -std=c99 -Wall -Wpedantic -Wextra -Werror -g3 -Wfloat-equal -Wvla -fprofile-arcs -ftest-coverage -c main.c

C:\msys64\home\Vlad\iu7-cprog-labs-2020-leonovvladislav\lab_04_00_02>gcc -std=c99 -Wall -Wpedantic -Wextra -Werror -g3 -Wfloat-equal -Wvla -fprofile-arcs -ftest-coverage -c str_handling.c

C:\msys64\home\Vlad\iu7-cprog-labs-2020-leonovvladislav\lab_04_00_02>gcc -o app.exe main.o str_handling.o -lgcov

```
## Тестирование

### Позитивные тесты
- 01 - обычный тест;
- 02 - одно слово;
- 03 - строка с большим кол-вом разделителей.


### Негативные тесты
- 01 - строка больше 256 символов;
- 02 - слово больше 16 символов;
- 03 - отсутствуют слова (только разделители);
- 04 - пустая строка.
### Результаты тестирования
```
$ ./make_func.cmd

C:\msys64\home\Vlad\iu7-cprog-labs-2020-leonovvladislav\lab_04_00_02>PUSHD func

C:\msys64\home\Vlad\iu7-cprog-labs-2020-leonovvladislav\lab_04_00_02\func>CALL ./all_test.cmd
Сравнение файлов pos_01_out.txt и OUT.TXT
FC: различия не найдены

Сравнение файлов pos_02_out.txt и OUT.TXT
FC: различия не найдены

Сравнение файлов pos_03_out.txt и OUT.TXT
FC: различия не найдены

Сравнение файлов neg_01_out.txt и OUT.TXT
FC: различия не найдены

Сравнение файлов neg_02_out.txt и OUT.TXT
FC: различия не найдены

Сравнение файлов neg_03_out.txt и OUT.TXT
FC: различия не найдены

Сравнение файлов neg_04_out.txt и OUT.TXT
FC: различия не найдены

```
### Покрытие тестами
```
$ gcov main.c str_handling.c
File 'main.c'
Lines executed:100.00% of 5
Creating 'main.c.gcov'

File 'str_handling.c'
Lines executed:100.00% of 40
Creating 'str_handling.c.gcov'

File 'C:/msys64/mingw64/x86_64-w64-mingw32/include/stdio.h'
Lines executed:100.00% of 5
Creating 'stdio.h.gcov'

```



# Задача 3
## Условие
Для решения этой задачи нужно использовать функции стандартной библиотеки для
обработки строк.

Написать программу, которая запрашивает у пользователя строку, разбивает строку на слова.

В результате разбора строки формируется массив слов.

Максимальные длины строки и слова, разделители слов такие же как в задаче 2.
Из слов, отличных от последнего, составляется новая строка, в которой слова разделяются одним пробелом. Слова в результирующую строку помещаются в обратном порядке. После последнего слова в результирующей строке пробел не добавляется.
Прежде, чем очередное слово помещается в результирующую строку, оно подвергается
указанному преобразованию.

Если результирующая строка не пустая, она выводится на экран с помощью вызова функции
printf следующим образом
```
printf("Result: %s\n", new_str);
```
Удалить из слова все последующие вхождения первой буквы.
## Декомпозиция

long str_reading(char *str_in) - чтение строки.  
size_t get_words(char *str_in, char words_arr[][MAXWORDSIZE + 1]) - разбиение строки на слова.  
void form_new_str(char words_arr[][MAXWORDSIZE + 1], size_t words_count, char *str) - формирование новой строки. 
## Компиляция
```
$ ./make_debug.cmd

C:\msys64\home\Vlad\iu7-cprog-labs-2020-leonovvladislav\lab_04_00_03>gcc -std=c99 -Wall -Wpedantic -Wextra -Werror -g3 -Wfloat-equal -Wvla -fprofile-arcs -ftest-coverage -c main.c

C:\msys64\home\Vlad\iu7-cprog-labs-2020-leonovvladislav\lab_04_00_03>gcc -std=c99 -Wall -Wpedantic -Wextra -Werror -g3 -Wfloat-equal -Wvla -fprofile-arcs -ftest-coverage -c str_handling.c

C:\msys64\home\Vlad\iu7-cprog-labs-2020-leonovvladislav\lab_04_00_03>gcc -o app.exe main.o str_handling.o -lgcov

```
## Тестирование

### Позитивные тесты
- 01 - обычный тест;
- 02 - строка с большим кол-вом разделителей.


### Негативные тесты
- 01 - строка больше 256 символов;
- 02 - слово больше 16 символов;
- 03 - отсутствуют слова (только разделители);
- 04 - пустая строка.
- 05 - нет слов отличных от последнего.
### Результаты тестирования
```
$ ./make_func.cmd

C:\msys64\home\Vlad\iu7-cprog-labs-2020-leonovvladislav\lab_04_00_03>PUSHD func

C:\msys64\home\Vlad\iu7-cprog-labs-2020-leonovvladislav\lab_04_00_03\func>CALL ./all_test.cmd
Сравнение файлов pos_01_out.txt и OUT.TXT
FC: различия не найдены

Сравнение файлов pos_02_out.txt и OUT.TXT
FC: различия не найдены

Сравнение файлов neg_01_out.txt и OUT.TXT
FC: различия не найдены

Сравнение файлов neg_02_out.txt и OUT.TXT
FC: различия не найдены

Сравнение файлов neg_03_out.txt и OUT.TXT
FC: различия не найдены

Сравнение файлов neg_04_out.txt и OUT.TXT
FC: различия не найдены

Сравнение файлов neg_05_out.txt и OUT.TXT
FC: различия не найдены

```
### Покрытие тестами
```
$ gcov main.c str_handling.c
File 'main.c'
Lines executed:100.00% of 8
Creating 'main.c.gcov'

File 'C:/msys64/mingw64/x86_64-w64-mingw32/include/stdio.h'
Lines executed:100.00% of 5
Creating 'stdio.h.gcov'

File 'str_handling.c'
Lines executed:100.00% of 44
Creating 'str_handling.c.gcov'
```